[
    {
        "speaker": "Andres",
        "text": "Buenos días, doctor. Recientemente he tenido mareos y fuertes dolores de cabeza."
    },
    {
        "speaker": "Hint",
        "text": "Good morning, Andres. I'm glad you came today. Let's start by reviewing your medical history. When did these symptoms begin?"
    },
    {
        "speaker": "Doctor",
        "text": "Buenos días, Andres. Me alegra que hayas venido el día de hoy. Empezaremos por revisar tu historia clínica. ¿Cuándo comenzaron estos síntomas?"
    },
    {
        "speaker": "Andres",
        "text": "Comenzaron hace unas dos o tres semanas. Al principio eran leves, pero durante la última semana han ido empeorando."
    },
    {
        "speaker": "Hint",
        "text": "I understand. Do you have any previous medical conditions we should consider?"
    },
    {
        "speaker": "Doctor",
        "text": "Entiendo. ¿Has tenido alguna condición médica previa que debamos considerar?"
    },
    {
        "speaker": "Andres",
        "text": "No, nada grave. Solo tengo antecedentes familiares de migrañas."
    },
    {
        "speaker": "Hint",
        "text": "This is important to know. Now we're going to perform a neurological exam. First, we'll assess your muscle strength and coordination."
    },
    {
        "speaker": "Doctor",
        "text": "Es importante saberlo. Ahora vamos a realizar un examen neurológico. Primero, evaluaremos tu fuerza muscular y coordinación."
    },
    {
        "speaker": "Andres",
        "text": "Claro, doctor. Estoy listo."
    },
    {
        "speaker": "Hint",
        "text": "Okay, squeeze my hands as hard as you can. Now, let's test your reflexes."
    },
    {
        "speaker": "Doctor",
        "text": "Bien, aprieta mis manos lo más fuerte como puedas. Ahora, vamos a probar tus reflejos."
    },
    {
        "speaker": "Andres",
        "text": "¿Está todo bien hasta ahora?"
    },
    {
        "speaker": "Hint",
        "text": "So far everything looks normal, but we need to run some additional tests, such as an MRI and EEG."
    },
    {
        "speaker": "Doctor",
        "text": "Hasta ahora todo parece normal, pero necesitamos hacer algunas pruebas adicionales, como una resonancia magnética y un electroencefalograma."
    },
    {
        "speaker": "Andres",
        "text": "¿Para qué es necesaria la resonancia magnética?"
    },
    {
        "speaker": "Hint",
        "text": "That's a good question. We want to make sure there's no abnormality in the brain causing these symptoms."
    },
    {
        "speaker": "Doctor",
        "text": "Es una buena pregunta. Queremos asegurarnos de que no haya ninguna anomalía en el cerebro que esté causando estos síntomas."
    },
    {
        "speaker": "Andres",
        "text": "Entiendo. ¿Cuánto tiempo tomará obtener los resultados de esta resonancia magnética?"
    },
    {
        "speaker": "Hint",
        "text": "The results should be ready in a few days, a week at most. Depending on what we find, we may need to perform further tests, such as an EEG, to learn more about the electrical activity in your brain."
    },
    {
        "speaker": "Doctor",
        "text": "Los resultados deberían estar listos en unos días, como máximo una semana. Dependiendo de lo que encontremos, podríamos necesitar hacer más pruebas, como un electroencefalograma, para aprender más sobre la actividad eléctrica en tu cerebro."
    },
    {
        "speaker": "Andres",
        "text": "Entonces, ¿crees que podría ser algo serio?"
    },
    {
        "speaker": "Hint",
        "text": "I understand your concern, but we can't draw any conclusions yet. First, we need to gather all the information about your symptoms and run these tests."
    },
    {
        "speaker": "Doctor",
        "text": "Entiendo tu preocupacion, pero no podemos sacar conclusiones todavía. Primero necesitamos recopilar toda la información sobre tus síntomas y realizar estas pruebas."
    },
    {
        "speaker": "Andres",
        "text": "Eso tiene razón. ¿Hay algo qué debo hacer mientras estamos esperando por estos resultados?"
    },
    {
        "speaker": "Hint",
        "text": "In general, it's a good idea to keep a record of your symptoms, including when they occur, what they're like, and how severe they are. This will help us better understand what we can do to prevent symptoms in the future."
    },
    {
        "speaker": "Doctor",
        "text": "En general, es recomendable mantener un registro de tus síntomas, incluyendo cuándo ocurren, cómo son, y qué tan intensos son. Esto nos ayudará a entender mejor lo que podemos hacer para prevenir los síntomas en el futuro."
    },
    {
        "speaker": "Andres",
        "text": "Lo haré, doctor. Aprecio mucho lo que estás haciendo para ayudar."
    },
    {
        "speaker": "Hint",
        "text": "You're welcome, Andres. Once we have the results, we'll talk about the next steps in your treatment."
    },
    {
        "speaker": "Doctor",
        "text": "De nada, Andres. Una vez que tengamos los resultados, hablaremos sobre los próximos pasos en tu tratamiento."
    },
    {
        "speaker": "Andres",
        "text": "Gracias, doctor. Estaré esperando los resultados."
    },
    {
        "speaker": "Hint",
        "text": "We will talk after."
    },
    {
        "speaker": "Doctor",
        "text": "Nosotros hablaremos despues."
    },
    {
        "speaker": "Andres",
        "text": "Doctor, mientras tanto, ¿hay algo que deba evitar para no empeorar los dolores de cabeza?"
    },
    {
        "speaker": "Hint",
        "text": "It's recommended that you avoid stress and activities that can trigger symptoms, such as excessive caffeine consumption or lack of sleep."
    },
    {
        "speaker": "Doctor",
        "text": "Es recomendable que evites el estrés y las actividades que puedan desencadenar los síntomas, como el consumo excesivo de cafeína o la falta de sueño."
    },
    {
        "speaker": "Andres",
        "text": "Entendido. También he notado que los mareos son más fuertes después de mis comidas. ¿Hay alguna razón para eso?"
    },
    {
        "speaker": "Hint",
        "text": "Symptoms can vary throughout the day due to many factors, such as changes in blood pressure or blood sugar levels. This is something we will investigate further with testing and recording of your symptoms."
    },
    {
        "speaker": "Doctor",
        "text": "Los síntomas pueden variar a lo largo del día, debido a muchas cosas, por ejemplo cambios en la presión arterial o en los niveles de azúcar en la sangre. Es algo que investigaremos más a fondo con las pruebas y el registro de tus síntomas."
    },
    {
        "speaker": "Andres",
        "text": "¿Debería cambiar mi dieta o mi rutina diaria mientras estamos averiguando las causas?"
    },
    {
        "speaker": "Hint",
        "text": "For now, try to get enough sleep, maintain a balanced diet, and try to minimize sources of stress in your life, but everyone knows this isn't easy."
    },
    {
        "speaker": "Doctor",
        "text": "Por ahora, trata de dormir lo suficiente, mantén una dieta equilibrada, y trata de minimizar los fuentes de estrés en tu vida, pero todo el mundo sabe que este no es facíl."
    },
    {
        "speaker": "Andres",
        "text": "Gracias por tu comprensión. Me preocupa que esto afecte mi desempeño en mi trabajo. ¿Crees que debería tomarme unos días libres para tratar de mejorar mis síntomas?"
    },
    {
        "speaker": "Hint",
        "text": "If symptoms are intense, it might be a good idea to rest. Therefore, flexibility in your work may help you better manage the situation, but in general, it's difficult to find the balance we want."
    },
    {
        "speaker": "Doctor",
        "text": "Si los síntomas son intensos, podría ser una buena idea descansar. Por eso, la flexibilidad en tu trabajo podría ayudarte a manejar mejor la situación, pero en general, es difícil encontrar el equilibrio que queramos."
    },
    {
        "speaker": "Andres",
        "text": "Gracias, haré lo posible para tomarme tiempo libre. ¿Crees que los dolores de cabeza podría estar relacionado con el hecho de que paso muchas horas frente a la computadora?"
    },
    {
        "speaker": "Hint",
        "text": "It's possible, because too much screen time can cause eye strain and stress, which could contribute to your symptoms."
    },
    {
        "speaker": "Doctor",
        "text": "Es posible, porque demasiado tiempo frente a la pantalla puede causar fatiga visual y estrés, lo cual podría contribuir a tus síntomas."
    },
    {
        "speaker": "Andres",
        "text": "Eso tiene sentido. Intentaré reducir el tiempo frente a la computadora y tomar más descansos, pero como dijiste, no será facíl."
    },
    {
        "speaker": "Hint",
        "text": "I think it's a good idea, Patient. Maintaining a balance between your work and your health is crucial."
    },
    {
        "speaker": "Doctor",
        "text": "Me parece una buena idea, Andres. Mantener un equilibrio entre tu trabajo y tu salud es crucial."
    },
    {
        "speaker": "Andres",
        "text": "Agradezco mucho tu ayuda y consejo, doctor. Estaré atento a cualquier cambio en mis síntomas."
    },
    {
        "speaker": "Hint",
        "text": "I'm here to support you, Patient. Don't hesitate to contact me if you have any questions or experience anything unusual before our next appointment."
    },
    {
        "speaker": "Doctor",
        "text": "Estoy aquí para apoyarte, Andres. No dudes en contactarme si tienes alguna pregunta o si experimentas algo inusual antes de nuestra próxima cita."
    },
    {
        "speaker": "Andres",
        "text": "Lo haré, doctor. Espero que los resultados sean favorables."
    },
    {
        "speaker": "Hint",
        "text": "We hope so. The long-term sustainability of your health is paramount. See you soon."
    },
    {
        "speaker": "Doctor",
        "text": "Eso esperamos. La sostenibilidad de tu salud a largo plazo es lo más importante. Nos vemos pronto."
    },
    {
        "speaker": "Andres",
        "text": "Hasta pronto, doctor. Gracias por todo."
    }
]